MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX130F064B.atdf
      <value-group caption="Comparator Negative Input Select bits for Comparator" name="CM2CON__CCH">
         <value caption="Comparator inverting input is connected to the IVREF" name="" value="0x3" />
         <value caption="Comparator inverting input is connected to the CxIND pin" name="" value="0x2" />
         <value caption="Comparator inverting input is connected to the CxINC pin" name="" value="0x1" />
         <value caption="Comparator inverting input is connected to the CxINB pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Positive Input Configure bit" name="CM2CON__CREF">
         <value caption="Comparator non-inverting input is connected to the internal CVref" name="" value="0x1" />
         <value caption="Comparator non-inverting input is connected to the CxINA pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Event Polarity Select bits" name="CM2CON__EVPOL">
         <value caption="Comparator interrupt is generated on a low-to-high or high-to-low transition of the comparator output" name="" value="0x3" />
         <value caption="Comparator interrupt is generated on a high-to-low transition of the comparator output" name="" value="0x2" />
         <value caption="Comparator interrupt is generated on a low-to-high transition of the comparator output" name="" value="0x1" />
         <value caption="Comparator interrupt generation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CM2CON__COUT">
         <value caption="Output of the Comparator is a 1" name="" value="0x1" />
         <value caption="Output of the Comparator is a 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Inversion bit" name="CM2CON__CPOL">
         <value caption="Output is inverted" name="" value="0x1" />
         <value caption="Output is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Enable bit" name="CM2CON__COE">
         <value caption="Comparator output is driven on the output CxOUT pin" name="" value="0x1" />
         <value caption="Comparator output is not driven on the output CxOUT pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator ON bit" name="CM2CON__ON">
         <value caption="Module is enabled. Setting this bit does not affect the other bits in this register" name="" value="0x1" />
         <value caption="Module is disabled and does not consume current. Clearing this bit does not affect the other bits in this register" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Negative Input Select bits for Comparator" name="CM3CON__CCH">
         <value caption="Comparator inverting input is connected to the IVREF" name="" value="0x3" />
         <value caption="Comparator inverting input is connected to the CxIND pin" name="" value="0x2" />
         <value caption="Comparator inverting input is connected to the CxINC pin" name="" value="0x1" />
         <value caption="Comparator inverting input is connected to the CxINB pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Positive Input Configure bit" name="CM3CON__CREF">
         <value caption="Comparator non-inverting input is connected to the internal CVref" name="" value="0x1" />
         <value caption="Comparator non-inverting input is connected to the CxINA pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Event Polarity Select bits" name="CM3CON__EVPOL">
         <value caption="Comparator interrupt is generated on a low-to-high or high-to-low transition of the comparator output" name="" value="0x3" />
         <value caption="Comparator interrupt is generated on a high-to-low transition of the comparator output" name="" value="0x2" />
         <value caption="Comparator interrupt is generated on a low-to-high transition of the comparator output" name="" value="0x1" />
         <value caption="Comparator interrupt generation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CM3CON__COUT">
         <value caption="Output of the Comparator is a 1" name="" value="0x1" />
         <value caption="Output of the Comparator is a 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Inversion bit" name="CM3CON__CPOL">
         <value caption="Output is inverted" name="" value="0x1" />
         <value caption="Output is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Enable bit" name="CM3CON__COE">
         <value caption="Comparator output is driven on the output CxOUT pin" name="" value="0x1" />
         <value caption="Comparator output is not driven on the output CxOUT pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator ON bit" name="CM3CON__ON">
         <value caption="Module is enabled. Setting this bit does not affect the other bits in this register" name="" value="0x1" />
         <value caption="Module is disabled and does not consume current. Clearing this bit does not affect the other bits in this register" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CMSTAT__C1OUT">
         <value caption="Output of Comparator 1 is a 1" name="" value="0x1" />
         <value caption="Output of Comparator 1 is a 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CMSTAT__C2OUT">
         <value caption="Output of Comparator 2 is a 1" name="" value="0x1" />
         <value caption="Output of Comparator 2 is a 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CMSTAT__C3OUT">
         <value caption="Output of Comparator 3 is a 1" name="" value="0x1" />
         <value caption="Output of Comparator 3 is a 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="CMSTAT__SIDL">
         <value caption="All Comparator modules are disabled when the device enters Idle mode" name="" value="0x1" />
         <value caption="All Comparator modules continue to operate when the device enters Idle mode" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00000" name="CORE" version="">
      <register-group name="CORE">
         <register caption="" name="zero" offset="0x0" rw="R" size="4" />
         <register caption="" name="at" offset="0x4" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="at" />
         </register>
         <register caption="" name="v0" offset="0x8" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="v0" />
         </register>
         <register caption="" name="v1" offset="0xc" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="v1" />
         </register>
         <register caption="" name="a0" offset="0x10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="a0" />
         </register>
