MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX130F064B.atdf
      <value-group caption="Software Reset Flag bit" name="RCON__SWR">
         <value caption="Software Reset was executed" name="" value="0x1" />
         <value caption="Software Reset as not executed" name="" value="0x0" />
      </value-group>
      <value-group caption="External Reset (MCLR) Pin Flag bit" name="RCON__EXTR">
         <value caption="Master Clear (pin) Reset has occurred" name="" value="0x1" />
         <value caption="Master Clear (pin) Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Voltage Regulator Standby Enable bit" name="RCON__VREGS">
         <value caption="Regulator is enabled and is on during Sleep mode" name="" value="0x1" />
         <value caption="Regulator is set to standby tracking mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Configuration Mismatch Reset Flag bit" name="RCON__CMR">
         <value caption="Configuration mismatch Reset has occurred" name="" value="0x1" />
         <value caption="Configuration mismatch Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Trigger bit" name="RSWRST__SWRST">
         <value caption="Enable Software Reset event" name="" value="0x1" />
         <value caption="No effect" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01423" name="RPIN" version="">
      <register-group name="RPIN">
         <register caption="" name="INT1R" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT1R" />
         </register>
         <register caption="" name="INT2R" offset="0x4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT2R" />
         </register>
         <register caption="" name="INT3R" offset="0x8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT3R" />
         </register>
         <register caption="" name="INT4R" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT4R" />
         </register>
         <register caption="" name="T2CKR" offset="0x14" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T2CKR" />
         </register>
         <register caption="" name="T3CKR" offset="0x18" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T3CKR" />
         </register>
         <register caption="" name="T4CKR" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T4CKR" />
         </register>
         <register caption="" name="T5CKR" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T5CKR" />
         </register>
         <register caption="" name="IC1R" offset="0x24" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC1R" />
         </register>
         <register caption="" name="IC2R" offset="0x28" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC2R" />
         </register>
         <register caption="" name="IC3R" offset="0x2c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC3R" />
         </register>
         <register caption="" name="IC4R" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC4R" />
         </register>
         <register caption="" name="IC5R" offset="0x34" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC5R" />
         </register>
         <register caption="" name="OCFAR" offset="0x44" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="OCFAR" />
         </register>
         <register caption="" name="OCFBR" offset="0x48" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="OCFBR" />
         </register>
         <register caption="" name="U1RXR" offset="0x4c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U1RXR" />
         </register>
         <register caption="" name="U1CTSR" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U1CTSR" />
         </register>
         <register caption="" name="U2RXR" offset="0x54" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U2RXR" />
         </register>
         <register caption="" name="U2CTSR" offset="0x58" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U2CTSR" />
         </register>
         <register caption="" name="SDI1R" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI1R" />
         </register>
         <register caption="" name="SS1R" offset="0x84" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS1R" />
         </register>
         <register caption="" name="SDI2R" offset="0x8c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI2R" />
         </register>
         <register caption="" name="SS2R" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS2R" />
         </register>
         <register caption="" name="REFCLKIR" offset="0xb4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="REFCLKIR" />
         </register>
      </register-group>
   </module>
   <module caption="" id="01423" name="RPOUT" version="">
      <register-group name="RPOUT">
         <register caption="" name="RPA0R" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA0R" />
         </register>
         <register caption="" name="RPA1R" offset="0x4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA1R" />
         </register>
         <register caption="" name="RPA2R" offset="0x8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA2R" />
         </register>
         <register caption="" name="RPA3R" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA3R" />
         </register>
         <register caption="" name="RPA4R" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA4R" />
         </register>
         <register caption="" name="RPA8R" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA8R" />
         </register>
         <register caption="" name="RPA9R" offset="0x24" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA9R" />
         </register>
